Revit 2027 API
Transform.Origin Property
Defines the origin of the old coordinate system in the new coordinate system.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public XYZ Origin { get; set; }
Public Property Origin As XYZ
	Get
	Set
public:
property XYZ^ Origin {
	XYZ^ get ();
	void set (XYZ^ value);
}
member Origin : XYZ with get, set
Property Value
XYZ
Exceptions
Exception | Condition
InvalidOperationException |  Thrown when the transform is internally marked as read-only.
Remarks
This corresponds to the fourth column vector of the conventional 3x4 matrix representation. Also, this is the translation component of the transformation.
See Also
Reference
Transform Class
Autodesk.Revit.DB Namespace